In [1]:
import numpy as np
import pandas as pd

### json_normalize 1 column to multiple columns

In [2]:
d= {
    'Name':'ABD',
    'Roll':123
}

## Dictionary

# You can flatten to a single row using json_normalize

pd.json_normalize(d)

  Name  Roll
0  ABD   123

In [3]:
d= [ {
    'Name':'ABD',
    'Roll':123
} ,  
{
    'Name':'BCD',
    'Roll':435
}
]


pd.json_normalize(d)

  Name  Roll
0  ABD   123
1  BCD   435

In [4]:
## NESTED

d= [ {
    'Name':'ABD',
    'Roll':123,
    'Nested':{
        'course':'Finance',
        'year':'2022'
    }
} ,  
{
    'Name':'BCD',
    'Roll':435,
    'Nested':{
        'course':'Math',
 
    }
}
]

pd.json_normalize(d)
## Missing elements

  Name  Roll Nested.course Nested.year
0  ABD   123       Finance        2022
1  BCD   435          Math         NaN

### EXPLODE -  1 column to multiple rows
## Reset Index if you don't wont same row number

In [5]:
arr= [[ 
     'Aravind',
    'Deva'
]]
df=pd.DataFrame()
df['Name']=arr
# df.explode(arr)

In [6]:
df.explode('Name')

      Name
0  Aravind
0     Deva

In [7]:
df.explode('Name').reset_index(drop=True)

      Name
0  Aravind
1     Deva